Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །གཞན་ཡང་དེར་སེམས་ཅན་རྣམས་རྟག་ཏུ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླང་བ་ལ་མངོན་པར་བརྩོན་པར་འགྱུར་རོ།
en: (8) The sentient beings living in those places will always exert themselves in following the paths of the ten virtuous actions.

source: །གཞན་ཡང་དེར་སེམས་ཅན་རྣམས་རྟག་ཏུ་བྱམས་པའི་སེམས་དང་ལྡན་པ་དང་། སྙིང་རྗེའི་སེམས་དང་ལྡན་པ་དང་། འདོད་ཆགས་དང་བྲལ་བའི་སེམས་དང་ལྡན་པར་འགྱུར་རོ།
en: (9) The sentient beings living in those places will always be loving, compassionate, and free of desires.

source: །གཞན་ཡང་ཁྱིམ་དང་ཞེས་བྱ་བ་ནས་ཡུལ་འཁོར་ཞེས་བྱ་བའི་བར་དེ་དང་དེ་དག་ཏུ་སེམས་ཅན་རྣམས་ངན་སོང་གསུམ་སྤངས་པ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: Finally, (10) sentient beings living in all those homes and lands will leave the three lower realms behind and be born within the higher realms.

source: །ལག་འགྲོའི་བདག་པོ་དེ་ལ་ཁྱིམ་དག་དང་ཞེས་བྱ་བ་ནས་ཡུལ་འཁོར་ཞེས་བྱ་བའི་བར་དུ་ང་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ཡི་གེར་བྲིས་ཤིང་ཡང་དང་ཡང་ཀློག་པའི་ཁྱིམ་ཞེས་བྱ་བ་ནས་ཡུལ་འཁོར་ཞེས་བྱ་བའི་བར་དེར་ཕན་ཡོན་དེ་དག་འབྱུང་བར་འགྱུར་ན། གང་དག་འདོན་པར་བྱེད་པ་དང་། ཆོས་དེ་དག་ལ་ཡང་དག་པར་སྣང་བར་བྱེད་པ་དང་། ཆོས་ཀྱི་གནས་པས་གནས་པར་བྱེད་པ་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Nāga lord, those ten benefits will manifest in the homes and lands where this great instruction of The Quintessence of the Sun is written down and repeatedly read in order to worship me, so there is no need to mention the benefit brought about by the persons who recite it, elucidate those Dharma teachings, and abide by the Dharma!

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ནི་ངས་བསྐལ་པ་བརྒྱར་ཡང་བསྟན་པར་སླ་བ་མ་ཡིན་ཏེ།
en: Even if I were to describe such a mass of merit for a hundred eons, this would not be an easy task!

source: ལག་འགྲོའི་བདག་པོ་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་དེ་ལྟར་ཟབ་བོ།
en: Nāga lord, such is the depth of this great instruction of The Quintessence of the Sun.

source: །ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་དེ་ལྟར་ཡོན་ཏན་ཆེ་བའོ། །དེ་ལྟར་ཕན་ཡོན་ཆེ་བའོ།
en: Such is the great quality and the great benefit of this great instruction of The Quintessence of the Sun!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནས་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། བདུད་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། དྲི་ཟ་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། གྲུལ་བུམ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། སྲུལ་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དེ་དག་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་ལ། དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: When the Blessed One had said this, the bodhisattva great beings who had come from all the buddha realms of the ten directions and all the māras, gods, nāgas, yakṣas, rākṣasas, asuras, garuḍas, gandharvas, kinnaras, mahoragas, kumbhāṇḍas, pretas, piśācas, pūtanas, humans, and nonhumans rejoiced and praised the words of the Blessed One with great exhilaration, joy, and delight.

source: འཕགས་པ་འདུས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ་ལས་ཉི་མའི་སྙིང་པོའི་ལེའུ་བཅུ་གཅིག་པ་རྫོགས་སོ།། །།
en: This concludes the eleven chapters included in “The Quintessence of the Sun,” the noble Great Vehicle discourse of The Great Assembly.

source: འཕགས་པ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ་རྫོགས་སོ།། །།རྒྱ་གར་གྱི་མཁན་པོ་སརྦ་ཛྙཱ་དེ་བ་དང་། བིདྱཱ་ཀ་ར་པྲ་བྷ་དང་། དྷརྨཱ་ཀ་ར་དང་། ལོ་ཙྪ་བ་བན་དེ་བཟང་སྐྱོང་གིས་བསྒྱུར། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་དཔལ་བརྩེགས་ཀྱིས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: This concludes the noble very extensive sūtra “The Quintessence of the Sun.” This was translated by the Indian preceptors Sarvajñadeva, Vidyākaraprabha, and Dharmākara and the translator Bandé Zangkyong. It was then edited and finalized by the translator-editor Bandé Kawa Paltsek.
